Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པའི་བར་དུ་ཡང་སྦྱར་བར་བྱའོ།
en: You should construe up to the purity of the knowledge of all aspects like this as well.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་དག་པ་གཅིག་གོ་ཞེས་མཇུག་བསྡུས་ཏེ་བསྟན་པ།
en: Summing up in conclusion it teaches that the purity of all dharmas is one.

source: དེ་ལྟར་ན་གཟུགས་རྣམ་པར་དག་པ་དང་། འབྲས་བུ་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ་འདི་དག་ནི་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ་ཞེས་བྱ་བ་སྟེ།
en: Therefore, those purities from the purity of form, the purity of the result, and the purity of the perfection of wisdom, up to the knowledge of all aspects, are “not two, not divided, not separate, and not broken apart.”

source: གཅིག་པའི་ཕྱིར་གཉིས་སུ་མེད་པའོ། །ཐ་དད་དུ་དབྱེ་མི་ནུས་པའི་ཕྱིར་གཉིས་སུ་བྱར་མེད་པའོ། །བྱེ་བྲག་མེད་པའི་ཕྱིར་སོ་སོ་མ་ཡིན་པའོ། །བར་ཆད་མེད་པའི་ཕྱིར་རམ་རྟག་པའི་ཕྱིར་ཐ་མི་དད་པའོ།
en: They are “not two” because they are the same; they are “not divided” because you cannot divide them into different things; they are “not separate” because a particular one does not exist; they are “not broken apart” because nothing obstructs them, or, because they are constant.

source: །དེ་ལྟར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་དང་ཐུན་མོང་བའི་འབྲས་བུ་རྣམ་པར་དག་པ་བསྟན་ཏོ།
en: Thus, it has taught the purity of the result shared in common with śrāvakas and pratyekabuddhas.

source: །ད་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པ་ཐུན་མོང་མ་ཡིན་པ་བསྟན་པའི་ཕྱིར། འབྲས་བུ་རྣམ་པར་དག་པ་བོར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འགའ་ཞིག་བཟུང་ནས་བསྟན་ཏེ།
en: Now, to teach the uncommon purity of bodhisattvas it leaves out the result, and it teaches having taken up only the purity of the perfection of wisdom.

source: དེ་ལྟར་འགྲེས་འདི་གཉིས་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་དག་པ་གཅིག་གོ་ཞེས་བསྟན་པ་ཡིན་ནོ།
en: Thus, these two passages teach that the purity of śrāvakas and pratyekabuddhas, and the purity of the tathāgata, are “one.”

source: །ད་ནི་རྣམ་པར་དག་པ་དེ་གང་ཟག་ལ་བདག་མེད་པའི་རྣམ་པར་དག་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དངོས་པོ་མེད་པའི་རྣམ་པར་དག་པ་དང་། ཆོས་ལ་བདག་མེད་པའི་རྣམ་པར་དག་པ་གསུམ་གྱིས་དེ་དག་རིམ་བཞིན་དུ་བསྟན་ཏེ།
en: Now it teaches the purity in a sequence of three connected sections: the purity that is the nonexistence of a self of persons, the purity that is the nonexistence of secondary afflictions, and the purity that is the nonexistence of a self in dharmas. “

source: བདག་རྣམ་པར་དག་པས་གཟུགས་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནི་བདག་དངོས་པོ་མེད་པར་ཤེས་པ་ཉིད་བདག་རྣམ་པར་དག་པའོ།
en: Because of the purity of self, there is the purity of form.” The knowledge that a self is a nonexistent thing is the purity of self.

source: །དེ་ལ་འགྲེས་ཀྱི་རིམ་པ་བཞིན་དུ་བསྟན་པར་བྱ་སྟེ།
en: There it should be taught in the order of the sections of the text.

source: བདག་རྣམ་པར་དག་པས་གཟུགས་རྣམ་པར་དག་པ་གཟུགས་རྣམ་པར་དག་པས་བདག་རྣམ་པར་དག་པ་སྟེ།
en: It teaches that “because of the purity of self, there is the purity of form.” Because of the purity of form there is the purity of self.

source: དེ་ལྟར་ན་བདག་རྣམ་པར་དག་པ་དང་གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ། གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: Thus, this purity of self and purity of form are not two, are not divided, are not separate, and are not broken apart.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམ་པར་དག་པ་དང་བདག་རྣམ་པར་དག་པས་རྣམ་པར་ཤེས་པ་དག་པ།
en: Similarly, “because of the purity of self, there is the purity of feeling… perception… volitional factors… and consciousness.

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས་བདག་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་བདག་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་བར་གྱི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་ཡང་གཉིས་སུ་མེད་པར་བསྟན་ཏོ།
en: Because of the purity of consciousness, there is the purity of self,” and so on, and that “the purity of self and purity of” all dharmas, up to, finally, “the purity of the knowledge of all aspects” is not two.

source: །དེའི་འོག་ཏུ་ཉོན་མོངས་པ་དངོས་པོ་མེད་པ་རྣམ་པར་དག་པའི་འགྲེས་ལ་ཡང་འདོད་ཆགས་རྣམ་པར་དག་པས་གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པས་འདོད་ཆགས་རྣམ་པར་དག་པ་སྟེ།
en: Then, in the section on the purity that is the nonexistence of secondary afflictions, “because of the purity of greed there is the purity of form; because of the purity of form there is the purity of greed.

source: དེ་ལྟར་ན་འདོད་ཆགས་རྣམ་པར་དག་པ་དང་གཟུགས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་ཅིང་ཞེས་བྱ་བ་ལ་སོགས་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་བར་གྱི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་དང་། འདོད་ཆགས་རྣམ་པར་དག་པ་གཉིས་སུ་མེད་པར་བཤད་དོ།
en: Thus, this purity of greed and the purity of form is not two,” and so on, again explains that the purity of dharmas, up to, finally, the knowledge of all aspects, and the purity of greed “is not two.”

source: །དེ་བཞིན་དུ་ཞེ་སྡང་དང་གཏི་མུག་དག་ལ་ཡང་སྦྱར་རོ།
en: Similarly connect this with “hatred, and confusion.”

source: །དེའི་འོག་ཏུ་ཆོས་བདག་མེད་པ་རྣམ་པར་དག་པའི་འགྲེས་ལ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་སོགས་པ་རྣམས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་བཟུང་ནས་ཆོས་གཉིས་ཀྱི་རྣམ་པར་དག་པ་གཉིས་སུ་མེད་པ་བཤད་པའི་འགྲེས་ནི། ཇི་ལྟར་མ་རིག་པ་རྣམ་པར་དག་པས་འདུ་བྱེད་རྣམ་པར་དག་པ།
en: Then, in the section on the purity that is the nonexistence of a self of dharmas, having taken up the purity of dharmas, the dependent originations, and so on, up to, finally, the knowledge of all aspects, there is the section explaining that the purity of two dharmas is not two: “Because of the purity of ignorance there is the purity of volitional factors; because of the purity of volitional factors there is the purity of ignorance.

source: འདུ་བྱེད་རྣམ་པར་དག་པས་མ་རིག་པ་རྣམ་པར་དག་པ་སྟེ་དེ་ལྟར་ན་མ་རིག་པ་རྣམ་པར་དག་པ་དང་།
en: Thus, this purity of ignorance and the purity of volitional factors is not two,” and so on.

source: འདུ་བྱེད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པ་འབྱུང་བ་དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་ཡང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: So too with the perfections as well, it says, “Because of the purity of the perfection of giving there is the purity of the perfection of morality; because of the purity of the perfection of morality there is the purity of the perfection of giving.

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་ཅེས་བྱ་བ་དང་དེ་བཞིན་དུ་ཐམས་ཅད་ལའང་སྦྱར་སྟེ།
en: Thus, this purity of the perfection of giving and the purity of the perfection of morality is not two,” and so on. All have to be construed in the same way as well.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: Thus, you should construe “because of the purity of the knowledge of the path aspects there is the purity of the knowledge of all aspects, because of the purity of the knowledge of all aspects there is the purity of the knowledge of all path aspects.

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་ཅེས་བྱ་བར་སྦྱར་བར་བྱའོ།
en: Thus, this purity of the knowledge of the path aspects and the purity of the knowledge of all aspects is not two,” and so on.

source: །དེ་ནས་ཡང་ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པ་བསྡུས་པའི་འགྲེས་ལ་ཡང་ཐོག་མར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྣམས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཕུང་པོ་ལ་སོགས་པ་ཚོར་བའི་ཚོགས་དྲུག་པོ་རྣམས་ཀྱི་མཐར་ཐུག་པའི་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པར་དག་པ་བཟུང་ནས་དེ་དག་གཉིས་སུ་མེད་པར་བསྟན་པའི་འགྲེས་ཏེ། ཇི་ལྟར་རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་གཟུགས་རྣམ་པར་དག་པ།
en: Then, also in the section gathering the purity of all dharmas together, first, having taken up among the six perfections the purity of the perfection of wisdom, and the purity of the aggregates and so on, up to, finally, the six collections of feelings, and the purity of the knowledge of all aspects, there is the section teaching that it is not two: “Furthermore, Subhūti, that purity of the perfection of wisdom is the purity of form.

source: གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: That purity of form is the purity of the knowledge of all aspects.

source: དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ་ཞེས་བྱ་བ་དེ་བཞིན་དུ་ཚོར་བ་རྣམས་དང་།
en: Thus, this purity of the perfection of wisdom, purity of form, and purity of the knowledge of all aspects is not two, not divided, not separate, and not broken apart.”

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་།
en: Similarly connect this with “feeling, perception, volitional factors, and consciousness,” up to “that purity of the perfection of wisdom is the purity of the feeling that arises from the condition of contact with the thinking mind.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་།
en: The purity of the feeling that arises from the condition of contact with the thinking mind is the purity of the knowledge of all aspects.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པ་ལ་ཡང་སྦྱར་བར་བྱའོ། །དེ་ནས་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ནས། ཕུང་པོ་ལ་སོགས་པ་ཚོར་བའི་མཐར་ཐུག་པའི་བར་གྱི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པར་དག་པ་བཟུང་ནས་དེ་དག་གཉིས་སུ་མེད་པ་བསྟན་པ་དང་། དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Thus, this purity of the perfection of wisdom, purity of the feeling that arises from the condition of contact with the thinking mind, and purity of the knowledge of all aspects is not two,” and so on.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་རྣམ་པར་དག་པ་དང་། ཚོར་བའི་མཐར་ཐུག་པའི་བར་གྱི་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་པར་བསྟན་པ་དང་། དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སོགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་ཆོས་རྣམས་དང་གཟུགས་ལ་སོགས་པ་ཚོར་བའི་ཚོགས་དྲུག་གི་མཐར་ཐུག་པའི་ཆོས་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དེ་དག་གཅིག་ཏུ་བཤད་པར་སྦྱར་བར་བྱའོ།
en: Then also, having taken up the purity of the dharmas—from the perfection of concentration up to the aggregates and so on, and finally the feelings—and “the purity of the knowledge of all aspects,” it teaches that it is not two; and similarly it teaches that the purity of the dharmas—all the perfections, all the emptinesses, up to, finally, the feelings—and “the purity of the knowledge of all aspects is not two”; and, similarly, it explains that (1) the purity of the dharmas, the applications of mindfulness, and so on, up to, finally, all-knowledge; and (2) the purity of the dharmas form and so on, up to, finally, the six collections of feelings; and (3) the purity of the knowledge of all aspects is one.

source: །དེ་ནས་ཡང་འདུས་བྱས་དང་། འདུས་མ་བྱས་རྣམ་པར་དག་པའི་འགྲེས་དང་། དུས་གསུམ་རྣམ་པར་དག་པའི་འགྲེས་བསྟན་ཏེ།
en: Then it teaches the section on “the purity of the compounded” and “the uncompounded,” and the section on the purity of the three time periods.

source: འདི་མན་ཆད་གནས་བརྟན་ཤཱ་རིའི་བུས་རྣམ་པར་དག་པ་བཤད་པ་ཐོས་ནས་སྤོབས་པ་སྐྱེས་ཏེ་འཁོར་བསྡུ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་འདི་ནི་ཟབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པས་རྣམ་པར་དག་པའི་ཚིག་བཅུ་གསུམ་རིམ་གྱིས་བསྟན་པར་བརྩམས་སོ།
en: The elder Śāriputra, having listened to the exposition of purity up to here, because a retinue is gathered together, musters the confidence to speak and says, “Lord, this purity is deep,” and so on. With this begins a sequence of thirteen statements about purity. “

source: །ཤཱ་རིའི་བུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཟབ་པོ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་དང་རྣམ་པར་རྟོག་པ་དུ་མའི་དྲི་མས་བརྩམས་པ་འཁོར་བའི་ཆོས་དེ་དག་དང་ཐ་དད་པར་མ་གྱུར་པའི་ཆོས་ཉིད་ནི་དྲི་མ་དེ་དག་གིས་དྲི་མ་ཅན་དུ་མ་གྱུར་པ་སྟེ།
en: Śāriputra, it is deep because it is extremely pure” says that the true nature of dharmas that is not broken apart from those saṃsāric dharmas, composed of the stains of the many afflictions, secondary afflictions, and conceptualizations, does not become stained by those stains.

source: དུས་ཐམས་ཅད་དུ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡིན་པར་བྱིས་པ་རྣམས་ཀྱི་ཡིད་ཆེས་པར་དཀའ་བས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཟབ་ཅེས་བྱའོ།
en: It is extremely pure at all times, so it is hard for fools to feel confidence in it. Hence it is called “deep because it is extremely pure.” “

source: །ཤཱ་རིའི་བུ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རྣམ་པར་དག་པ་ནི་སྣང་བའོ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ་དཔེར་ན་སྤྲིན་དང་། ན་བུན་དང་ཁུག་རྣ་ལ་སོགས་པ་མེད་ན་ཉི་མ་དང་ཟླ་བ་ལ་སོགས་པ་ཤིན་ཏུ་རྣམ་པར་དག་པ་སྟེ། རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: Śāriputra, purity is light because it is extremely pure,” To illustrate, the sun and moon and so on are extremely pure, that is, they shine brightly where there are no clouds, fog, haze and so on.

source: །དེ་བཞིན་དུ་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་ཡང་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་སྣང་བ་ཞེས་བྱའོ། །དེ་བས་ན་གཟུགས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རྣམ་པར་དག་པ་སྣང་བའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Similarly, the true dharmic nature of form and so on is called “light because it is extremely pure,” so it says “purity is light because form is extremely pure.” “

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་ཉིང་མཚམས་སྦྱོར་བ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་དང་།
en: Lord, purity does not link up.”

source: རྣམ་པར་རྟོག་པའི་སྤྲོས་པའི་དྲི་མ་རྣམས་སྤངས་པ་ནི་སླར་ཉིང་མཚམས་མི་སྦྱར་བའི་ཕྱིར།
en: Because the stains of the proliferation of afflictions and conceptualizations have stopped there is no further linking up, so, because it is stainless and pure, it is said that it “does not link up.” “

source: དྲི་མ་མེད་ཅིང་རྣམ་པར་དག་པས་ན་ཉིང་མཚམས་སྦྱོར་བ་མེད་པ་ཞེས་བྱའོ། །ཤཱ་རིའི་བུ་གཟུགས་ལ་འཕོ་བ་མེད་པས་ཉིང་མཚམས་སྦྱོར་བ་མེད་པ་ནི་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་ཡོངས་སུ་སྤངས་པ་རྣམས་ནི་ཡང་འཕོ་བ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Śāriputra, form does not link up because it does not change places, so it is pure” means because falsely imagined form and so on that have been abandoned do not change places again, they have stopped. “

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་སྤྲིན་དང་ན་བུན་དང་ཁུག་རྣ་ལ་སོགས་པ་ཡོད་དུ་ཟིན་ཀྱང་ནམ་མཁའ་ལྟར་རྣམ་པ་ཐམས་ཅད་དུ་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའོ་ཞེས་བཤད་པའོ།
en: Lord, purity is without defilement” is saying that even though there have been clouds, fog, haze and so on, like space, in its basic nature it is thoroughly clean. “Lord, there is no obtaining and no clear realization of purity.”

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་འཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་ཐོབ་པར་བྱ་བ་དང་ཐོབ་པར་བྱེད་པའི་ཆོས་གཉིས་ཡོད་ན། འཐོབ་པ་ཡང་ཡོད་པར་འགྱུར་ལ། མངོན་པར་རྟོགས་པར་བྱ་བ་དང་། མངོན་པར་རྟོགས་པར་བྱེད་པ་གཉིས་ཡོད་ན་མངོན་པར་རྟོགས་པ་ཞེས་བྱ་བ་ཡོད་པར་འགྱུར་ན་དེ་ལ་ཀུན་རྟོག་པ་དང་།
en: Were the two dharmas—something obtained and a cause of obtaining—to exist, there would be an “obtaining”; were the two dharmas—something clearly realized and a cause of clear realization—to exist, there would be a “clear realization.”

source: རྣམ་པར་རྟོག་པ་རྣམས་མེད་པ་ཙམ་ལ་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཉིད་རྣམ་པར་དག་པ་ཞེས་རྣམ་པར་གཞག་པའི་ཕྱིར་རྣམ་པར་དག་པ་དེ་ལ་འཐོབ་པའམ། མངོན་པར་རྟོགས་པ་ཞེས་བྱ་བ་གང་ཡང་མེད་དོ།
en: But because the mere nonexistence of false imagining and conceptualizing is posited as the “purity” that is the thoroughly established true nature of dharmas, “obtaining” and “clear realization” do not exist in that purity at all. “

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་མངོན་པར་མ་གྲུབ་པའོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པ་དང་།
en: Lord, purity does not come into being.” “

source: རྣམ་པར་བརྟགས་པའི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མངོན་པར་གྲུབ་པ་མེད་པ་ལ་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་རྣམ་པར་གཞག་པའི་ཕྱིར་མངོན་པར་གྲུབ་པ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: Purity” is posited as the dharmas, falsely imagined and conceptualized form and so on, not coming into being, so it is “marked by not coming into being.” “

source: །རྣམ་པར་དག་པ་ནི་འདོད་པ་དང་།
en: Lord, purity does not arise in the desire realm… the form realm… [or] the formless realm.”

source: གཟུགས་དང་གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེ་བ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནི་འདོད་པ་དང་གཟུགས་དང་གཟུགས་མེད་པའི་ཁམས་རྣམས་ཀུན་བརྟགས་པ་སྟེ།
en: The desire, form, and formless realms are falsely imagined.

source: གང་གི་ཚེ་དེ་རྣམས་སུ་མི་སྐྱེ་ཞིང་མི་འབྱུང་བ་དེ་ལ་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ། དེ་བས་འདོད་པའི་ཁམས་ཀྱི་རང་བཞིན་མི་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: When not arising and appearing in them it is called “purity,” so it says “because you cannot apprehend the desire realm’s intrinsic nature.” “

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་འཚལ་བ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་བདག་རང་ཤེས་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Lord, purity does not know” means the self is not the intrinsic nature self-awareness. “

source: །ཆོས་བླུན་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་ནི་རྟོག་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་བླུན་པ་ཞེས་བཤད་དོ།
en: Because dharmas are inanimate material”— it is saying “dharmas are inanimate material” because they are free from conceptual consciousness. “

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པས་གཟུགས་མ་འཚལ་ཏོ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཀྱང་མི་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Lord, purity does not know form.” This means it also does not see all dharmas, form and so on. “

source: །རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because it is empty of its own mark” means things like form and so on are without defining marks.

source: །འཚལ་བ་མ་མཆིས་པ་ཞེས་བྱ་བ་འདིས་ནི་རྣམ་པར་དག་པ་རྣམ་པར་མི་རྟོག་པའི་མཚན་ཉིད་ཡིན་པར་བསྟན།
en: This “does not know” teaches that purity is the mark of the absence of conceptualization.

source: རྣམ་པར་དག་པས་གཟུགས་མི་ཤེས་སོ་ཞེས་བྱ་བ་འདིས་ནི་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་མཚན་ཉིད་ཡིན་པར་བསྟན་ཏེ།
en: This “purity does not know form” teaches that dharmas are the mark of nonexistence.

source: གཉིས་ཀྱིས་ནི་དམིགས་པར་བྱ་བ་དང་། དམིགས་པར་བྱེད་པ་དངོས་པོ་མེད་པའི་མཚན་ཉིད་བསྟན་ཏོ།
en: The two teach the mark of the nonexistence of apprehended object and apprehending subject. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྨན་པར་མི་བགྱིད་གནོད་པར་མི་བགྱིད་ཅེས་བྱ་བ་ནི་གང་གི་ཕྱིར་དེ་གཉིས་ཀ་ཡང་དེ་བཞིན་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཏེ།
en: Lord, the perfection of wisdom does not help nor does it hinder the knowledge of all aspects,” because both, marked by suchness, are “extremely pure.”

source: དེ་བཞིན་ཉིད་ནི་དེ་བཞིན་ཉིད་ལ་ཕན་པའམ་གནོད་པར་མི་བྱེད་དེ། ནམ་མཁའ་ལ་ནམ་མཁའ་བཞིན་ནོ།
en: Suchness does not help and does not hinder suchness, just like space does not help and does not hinder space.

source: །དེ་བས་ན་ཆོས་ཀྱི་དབྱིངས་འདུག་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་བཤད་དེ།
en: Therefore, it says “because of the establishment of the dharma-constituent.”

source: ཆོས་ཀྱི་སྐུ་ནི་དུས་ཐམས་ཅད་དུ་གནས་པའི་མཚན་ཉིད་ཡིན་ན་དེ་ལ་སུ་ཞིག་ཕན་པ་དང་།
en: This is teaching that nobody helps or hinders the dharma body, given that at all times it is marked by staying in the same state. “

source: གནོད་པ་བྱེད་པ་ཡོད་ཅེས་བསྟན་པའོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ནི་ཆོས་གང་ཡོངས་སུ་ལེན་པ་མ་མཆིས་སོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་ཏེ།
en: Lord, the purity that is the perfection of wisdom does not assist any dharma,” because the extremely pure perfection of wisdom is the mark of not taking hold of anything.

source: གལ་ཏེ་ཆོས་འགའ་ཞིག་ཡོངས་སུ་འཛིན་ན་རྣམ་པར་དག་པར་མི་འགྱུར་རོ།
en: Were it to take hold of any dharma it would not be pure.

source: །དེའི་འོག་ཏུ་གནས་བརྟན་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་བདག་རྣམ་པར་དག་པའི་སླད་དུ་གཟུགས་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ནི་བདག་དངོས་པོ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། གཟུགས་ལ་སོགས་པ་དངོས་པོ་མེད་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །འདིར་ནི་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་དངོས་པོ་མེད་པ་ལ་བྱ་བའི་ཕྱིར་རོ།
en: Then the statements by the elder Subhūti, “Lord, form is pure because self is pure” and so on, mean that because the self is something that is nonexistent, form and so on are things that do not exist either, because here you have to take “purity” as something that does not exist.

source: །དེ་བས་ན་རབ་འབྱོར་བདག་མེད་པའི་ཕྱིར་གཟུགས་མེད་པ་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པའོ་ཞེས་གསུངས་སོ།
en: Hence, it says “because it is extremely pure, Subhūti.”

source: །སྔར་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་བསྟན་ཏོ། །ད་ནི་བདག་མེད་པ་རྣམ་པར་དག་པ་བསྟན་ཏེ།
en: Earlier it was teaching the pure perfection of wisdom, now it is teaching the purity of selflessness. “

source: རབ་འབྱོར་ཤེས་པ་མ་རྙེད་མ་སྟོར་བའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་སྔོན་མ་བྱུང་བའི་ཡེ་ཤེས་ཐོབ་ཅིང་རྙེད་པ་མེད་ལ། ཡེ་ཤེས་རྙེད་པ་ཡང་ཆུད་ཟོས་པ་མེད་དེ། དེ་ལྟར་གཉིས་ཀ་མེད་པས་བྱང་ཆུབ་ཀྱང་མེད་དོ།
en: Because knowledge is not found and is not discarded, Subhūti.” They do not obtain or find a transcendent knowledge that was not there before, and a transcendent knowledge that is found is also not lost, so, because there are neither, there is not even awakening.

source: །བྱང་ཆུབ་ཅེས་བྱ་བ་ཡང་ཀུན་བརྟགས་པ་ཉིད་དོ།
en: Even “awakening” is falsely imagined. “

source: །གཉིས་སུ་མ་མཆིས་ཤིང་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་གཉིས་མེད་པའི་ཕྱིར་སྔོན་གྱི་ཚེ་ཡང་ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པས་ནམ་མཁའ་བཞིན་དུ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: Nonduality and purity”— because the two—defilement and purification—do not exist, it is pure in its intrinsic nature even before, so like space it has no defilement.

source: །ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་ཡང་ནམ་མཁའ་བཞིན་དུ་སྔོན་མ་བྱུང་བའི་རྣམ་པར་བྱང་བ་མེད་དོ།། །།
en: And even at the period of the final outcome, it is like space that has no purity that was not there before.

source: བམ་པོ་ཉི་ཤུ་པ། དེ་ལྟར་རྣམ་པར་དག་པ་བཤད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། དེའི་འོག་ཏུ་ཟབ་པར་ཡིད་ཆེས་པར་བྱ་བའི་ཕྱིར་ཀུན་དུ་མཐའ་ཡས་པ་བཤད་པར་བརྩམས་པ། གཟུགས་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར་ཞེས་བྱ་བ་སྟེ་རྟག་པ་དང་ཆད་པ་མེད་པ་དང་།
en: Having thus completed the explanation of purity, it begins the explanation of the unlimited to inculcate belief in the deep, with “because form is unlimited.”

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་དབུས་ཀྱི་མཐའ་མེད་པའི་ཕྱིར་ཀུན་ཏུ་མཐའ་ཡས་པའོ།
en: It is “unlimited” because it is not permanent and not annihilated, and is not at the prior limit, later limit, or in the middle.

source: །དེ་བས་ན་རབ་འབྱོར་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་ཐོག་མ་དང་ཐ་མ་མེད་པའི་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་གསུངས་སོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Therefore, it says “because of the emptiness of what transcends limits and the emptiness of no beginning and no end, Subhūti.”

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་དེ་ལྟར་རྟོག་པ་གང་ལགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལགས་ཞེས་བྱ་བ་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཅིའི་ཕྱིར་ཞུས་ཤེ་ན།
en: Why does the elder Subhūti ask, “Lord, why is such a realization as that the perfection of wisdom of bodhisattva great beings?”

source: དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡུལ་དོན་ཟབ་པ་དེ་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་ལགས་སངས་རྒྱས་རྣམས་ཀྱི་མ་ལགས་ཞེས་ཞུས་པའོ།
en: He is asking why, if the perfection of wisdom is so deep a topic as that, is it just an object of bodhisattvas, not of buddhas.

source: །རབ་འབྱོར་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མཐར་ཕྱིན་ཅིང་།
en: It says, “Because it is the knowledge of path aspects, Subhūti.” Thus, this perfection of wisdom is not the final one, is not when the work is done.

source: བྱ་བ་བྱས་པ་མ་ཡིན་གྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་གྱི་རྣམ་པ་སྟེ། དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱིས་ཞེས་བྱའོ།
en: It is an aspect of the path of the knowledge of all aspects, hence it is “just of bodhisattvas.” “
